app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("name", "created_at", "section_id", "updated_at", "url", "description", "state") VALUES('', '2009-02-24 18:35:38', 1, '2009-02-24 18:35:38', 'http://tutorialblog.org/100-ajax-tutorials-and-resources/', '', 't')
---
  def create
    @favorite = @section.favorites.build(params[:favorite])
    respond_to do |format|
      if @favorite.save

SELECT * FROM "favorites" WHERE ("favorites".section_id = 1) LIMIT 20 OFFSET 0
---
  def index
    @favorites = @section.favorites.paginate(:page => params[:page], :per_page => FAVORITES_PER_PAGE)

UPDATE "favorites" SET "updated_at" = '2009-02-24 19:01:14', "section_id" = 2 WHERE "id" = 1
---
  def update
    respond_to do |format|
      if @favorite.update_attributes(params[:favorite])

SELECT * FROM "sections" WHERE (1 = 1 AND (4 BETWEEN lft AND rgt)) ORDER BY lft
SELECT max("sections".rgt) AS max_rgt FROM "sections" WHERE (1 = 1)
SELECT * FROM "favorites" WHERE ("favorites"."id" = 1 AND ("favorites".section_id = 1))
---
  def find_favorite
  	@section = Section.find(params[:section_id]) if params[:section_id]
    @favorite = @section.favorites.find(params[:id]) if params[:id]