app/controllers/sections_controller.rb

INSERT INTO "sections" ("name", "created_at", "updated_at", "lft", "user_id", "parent_id", "rgt") VALUES('Rails', '2009-02-24 15:24:08', '2009-02-24 15:24:08', 3, 1, NULL, 4)
---
  def create
    @section = @user.sections.build(params[:section])
    respond_to do |format|
      if @section.save

SELECT * FROM "sections" WHERE (1 = 1 AND (1 BETWEEN lft AND rgt)) ORDER BY lft
---
  def index
    @sections = @user.sections.paginate(:page => params[:page], :per_page => SECTIONS_PER_PAGE)

UPDATE "sections" SET lft = CASE WHEN lft BETWEEN 4 AND 4 THEN lft + 2 WHEN lft BETWEEN 5 AND 6 THEN lft + -1 ELSE lft END, rgt = CASE WHEN rgt BETWEEN 4 AND 4 THEN rgt + 2 WHEN rgt BETWEEN 5 AND 6 THEN rgt + -1 ELSE rgt END, parent_id = CASE WHEN id = 3 THEN 1 ELSE parent_id END WHERE (1 = 1)
---
  def update
    respond_to do |format|
      if @section.update_attributes(params[:section])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "sections" WHERE (1 = 1 AND (parent_id IS NULL OR parent_id = 0) AND (4 BETWEEN lft AND rgt)) LIMIT 1
SELECT max("sections".rgt) AS max_rgt FROM "sections" WHERE (1 = 1)
---
		def find_section
			@user = User.find(current_user.id) if current_user
			@section = @user.sections.find(params[:id]) if params[:id]