app/controllers/site_controller.rb

SELECT * FROM "favorites" WHERE ("favorites".section_id = 1)
SELECT * FROM "sections"
---
  def index
		@favorites = Favorite.active.all
		@section = current_user.sections.build unless current_user.blank?