app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
		def find_user
			if params[:login]
				@user = User.find_by_login(params[:login])
			else
				@user = User.find(params[:id])